# RbsGbxmlSurfaceName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsGbxmlSurfaceName Property
ParameterTypeId Class See Also
---
"Surface Name"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsGbxmlSurfaceName { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsGbxmlSurfaceName As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsGbxmlSurfaceName {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace